{
  "backend/main.mo": "Main backend actor implementing e-commerce functionality with product management, user profiles, orders, Stripe payments, blob storage, and role-based access control using mixins for authorization and storage.",
  "feature_evidence.json": "Feature evidence report documenting three admin login authentication flow fixes with high confidence, targeting AdminGuard, AppShell, and useAdminOnboarding files across multiple components.",
  "frontend-file-summaries.txt": "JSON summary of frontend files documenting fixes to import paths, addition of extensive logging throughout admin authentication flow, and branding updates to \"Neelamaa\".",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system with warm rose/amber tones for light and dark modes, including sidebar and chart color variables.",
  "frontend/index.html": "HTML entry point with document title set to \"Neelamaa\" and root div for React mounting.",
  "frontend/src/App.tsx": "Main React app component defining TanStack Router configuration with routes for storefront, cart, checkout, orders, profile, admin pages, and payment flows, wrapped in ThemeProvider with ProfileSetupModal and Toaster.",
  "frontend/src/components/admin/AdminDashboardPage.tsx": "Admin dashboard page wrapped in AdminGuard displaying navigation cards for managing orders, products, and payment settings (coming soon).",
  "frontend/src/components/admin/AdminGuard.tsx": "Admin access guard component with extensive console logging that checks admin status via actor query, displays access denied messages for non-admins, and provides a \"Claim Admin\" button with error handling for first-time admin onboarding.",
  "frontend/src/components/admin/AdminOrderDetailPage.tsx": "Displays detailed information about a single order for admins, including customer details, order items with images, status badge, and order/payment IDs. Uses route params to fetch and render order data with loading skeletons.",
  "frontend/src/components/admin/AdminOrdersPage.tsx": "Lists all orders in the system for admin users with status badges, customer names, dates, and totals. Each order card links to the detail page and displays a truncated order ID.",
  "frontend/src/components/admin/AdminProductsPage.tsx": "Admin product management page that displays a grid of products with images and prices, and provides a dialog to create new products using the ProductEditor component.",
  "frontend/src/components/admin/ProductEditor.tsx": "Form component for creating products with fields for name, description, price, category, and multiple image uploads with progress tracking. Handles image upload via ExternalBlob and submits product data with price converted to cents.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button that toggles between login and logout states using Internet Identity, clearing the query cache on logout and handling authentication errors.",
  "frontend/src/components/cart/CartPage.tsx": "Shopping cart page displaying cart items with quantity controls, remove buttons, and a checkout button that requires authentication. Shows empty state when cart is empty.",
  "frontend/src/components/checkout/CheckoutPage.tsx": "Checkout page that displays shipping information from user profile, order summary, and handles order creation followed by Stripe checkout session redirect. Stores pending order ID and clears cart on successful checkout initiation.",
  "frontend/src/components/checkout/OrderConfirmationPage.tsx": "Displays order confirmation after successful checkout with order details, total, and navigation buttons to view order details or continue shopping.",
  "frontend/src/components/common/EmptyState.tsx": "Reusable component that displays an empty state with an icon, title, optional description, and optional action button.",
  "frontend/src/components/layout/AppShell.tsx": "Main application layout with sticky header, navigation menu, cart badge, login buttons, and admin access; includes mobile sheet menu.",
  "frontend/src/components/orders/MyOrdersPage.tsx": "Lists all orders for authenticated users with status badges, order summaries, and links to detailed order views; shows empty state for no orders.",
  "frontend/src/components/orders/OrderDetailPage.tsx": "Displays detailed order information including items, status, payment ID, pricing breakdown, and shipping address for a specific order.",
  "frontend/src/components/payments/PaymentFailure.tsx": "Shows payment cancellation message with options to retry payment or view orders; clears pending order state.",
  "frontend/src/components/payments/PaymentSuccess.tsx": "Processes payment completion after Stripe redirect, verifies session and order, then redirects to order confirmation page.",
  "frontend/src/components/profile/ProfilePage.tsx": "User profile management page with editable fields for name, phone number, and address; includes logout functionality and authentication checks.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal component for initial user profile setup, collecting name, phone number (with country code), and optional shipping address with validation and submission via useSaveUserProfile hook.",
  "frontend/src/components/storefront/CategoryBrowsePage.tsx": "Displays a list of product categories (Women's Clothing and Jewelry) as clickable cards that navigate to filtered product listings.",
  "frontend/src/components/storefront/HomePage.tsx": "Main storefront landing page with hero banner, category cards, and featured products grid with loading skeletons.",
  "frontend/src/components/storefront/ProductDetailPage.tsx": "Product detail view with image carousel, description, quantity selector, and add-to-cart functionality with loading and error states.",
  "frontend/src/components/storefront/ProductListPage.tsx": "Displays filterable product grid with optional category filtering, showing product cards with images, prices, and quick add-to-cart buttons.",
  "frontend/src/components/storefront/SearchPage.tsx": "Search interface with text input that filters products by name or description, displaying results in a grid with add-to-cart functionality.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useAdminOnboarding.ts": "Provides a mutation hook to claim first admin privileges by assigning the caller the admin role, with error handling for existing admins and unauthorized access.",
  "frontend/src/hooks/useAdminOrders.ts": "Query hook that fetches all orders for admin users via the getAllOrders actor method.",
  "frontend/src/hooks/useAdminProducts.ts": "Mutation hook for creating products with name, description, price, and images, invalidating the products query on success.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "Mutation hook that creates a Stripe checkout session from shopping items and returns the session ID and URL.",
  "frontend/src/hooks/useCreateOrder.ts": "Empty file with no content.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Query hook that fetches the current authenticated user's profile via getCallerUserProfile, handling loading states.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login, logout, identity state, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useMyOrders.ts": "Empty file with no content.",
  "frontend/src/hooks/useProduct.ts": "Empty file with no content.",
  "frontend/src/hooks/useProducts.ts": "Query hooks for fetching all products or a single product by ID from the actor.",
  "frontend/src/hooks/useQueries.ts": "Comprehensive collection of query and mutation hooks for products, orders, payments, and Stripe configuration, including CRUD operations and payment completion.",
  "frontend/src/hooks/useSaveUserProfile.ts": "Mutation hook for saving the current user's profile via saveCallerUserProfile, invalidating the profile query on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/state/cart.ts": "Zustand store with persistence for shopping cart state, managing items, quantities, totals, and cart operations (add, remove, update, clear).",
  "frontend/src/state/pendingPayment.ts": "Utility functions for managing pending order IDs in sessionStorage during the payment flow.",
  "frontend/src/utils/format.ts": "Formatting utilities for displaying prices (cents to dollars), dates (timestamp to locale string), and order status labels.",
  "frontend/src/utils/phone.ts": "Phone number utilities for parsing, formatting, and validating international phone numbers with country codes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, custom animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting a mobile e-commerce app for women's apparel with features including customer registration via phone, ordering/checkout, payment integration, multi-admin management via Internet Identity, and a known issue with admin login not working."
}